/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "sfr_r838a.h"                  /* R8C/38A SFRの定義ファイル    */
#include "printf_lib.h"                 /* printf使用ライブラリ         */
#include "microsd_lib.h"                /* microSD制御ライブラリ        */
#include "lcd_lib.h"                    /* LCD表示用追加                */
#include "switch_lib.h"                 /* スイッチ追加                 */
#include "data_flash_lib.h"             /* データフラッシュライブラリ   */
#include "isCamera.h"
#include "isCheck.h"

/************************************************************************/
/* クロスライン検出処理                                                 */
/* 戻り値 0:クロスラインなし 1:あり                                     */
/************************************************************************/
int check_crossline( void )
{

    if( Wide > 80 ) {
        return 1;	/* クロスライン発見！ */
    }else{
		return 0;	/* クロスラインなし  */
	}
}

/************************************************************************/
/* 右ハーフライン検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_rightline( void )
{
/*	printf("sval[14] = ");float_printf(sval[14],3);
	printf("sval[15] = ");float_printf(sval[15],3);
	printf("\n\n");
*/  if( (Wide > 30) && (Center > 0) ) {
        return 1;	/* 右ハーフライン発見！ */
    }else{
		return 0;	/* 右ハーフラインなし  */
	}
}

/************************************************************************/
/* 左ハーフライン検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_leftline( void )
{
/*	printf("sval[0] = ");float_printf(sval[0],3);
	printf("sval[1] = ");float_printf(sval[1],3);
	printf("\n\n");
*/  if( (Wide > 30) && (Center < 0) ) {
        return 1;	/* 左ハーフライン発見！ */
    }else{
		return 0;	/* 左ハーフラインなし  */
	}
}
